Repository: omar-mohamed-abu-elnasr/E-S-L
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Welcome to
ar: مرحبا في

# ourApplication
source: Our application provides Real-Time Egyptian Sign Language ‘ESL’ Translation for Deaf people to communicate
ar: يوفر تطبيقنا ترجمة لغة الإشارة المصرية في الوقت الحقيقي للأشخاص الذين يعانون من الصم للتواصل

# noNeed
source: No need for an account
ar: لا داعي لعمل ايميل

# youCanEasy
source: You can easily capture the sign language and turn it to text or audio
ar: يمكنك بسهولة التقاط لغة الإشارة وتحويلها إلى نص أو صوت

source: Next
ar: التالي

source: Back
ar: تراجع

# letsGet
source: Let’s get start
ar: لنبدأ

# itHelps
source: It helps you keep in touch, understand and even get to learn more about ESL
ar: يساعدك على البقاء على اتصال وفهم و التعرف على المزيد حول لغة الإشارة المصرية

# theLanguage
source: The language dictionary
ar: قاموس اللغه

# theESL
source: The ESL Alphabets & Numbers
ar: الحروف الهجائية والأرقام

source: ESL Articles
ar: مقالات لغة الإشارة المصرية

source: ESL Videos
ar: فيديوهات لغه الإشارة المصرية

source: About Us
ar: من نحن؟

# weAre
source: We are a team of 7 Egyptian computer science students -IS Department- designed and implemented this application to help people with poor hearing abilities, deaf/mute or with any other sort of special needs that makes use of sign language to communicate with others, to be our graduation project.
ar: نحن فريق مكون من 7 طلاب علوم حاسوب مصريين - قسم نظم المعلومات - قمنا بتصميم وتنفيذ هذا التطبيق لمساعدة الأشخاص ذوي القدرات السمعية الضعيفة و الصم والبكم أو أي نوع آخر من الاحتياجات الخاصة التي تستخدم لغة الإشارة للتواصل مع الآخرين، وليكون مشروع التخرج لدينا.

# aboutThe
source: About The Application
ar: حول التطبيق

# whenWe
source: When we designed this application we built it from scratch to make sure that the communication will be easier between sign language users ”Egyptian Sign Language” and people who has no previous knowledge about sign language using AI technologies based on real-time translation, which provides more understanding to the people special needs and make them more connected with the whole society, and not to feel isolated any more.
ar: عندما قمنا بتصميم هذا التطبيق قمنا ببنائه من الصفر للتأكد من أن التواصل سيكون أسهل بين مستخدمي لغة الإشارة “لغة الإشارة المصرية” والأشخاص الذين ليس لديهم معرفة سابقة بلغة الإشارة باستخدام تقنيات الذكاء الاصطناعي المعتمدة على الترجمة الفورية، والتي توفر المزيد من الفهم لذوي الاحتياجات الخاصة وجعلهم أكثر تواصلاً مع المجتمع بأكمله، وعدم الشعور بالعزلة بعد الآن.

source: Contact Us
ar: تواصل معنا

# havingProblem
source: Having a problem using the application or need to reach out with us
ar: تواجه مشكلة في استخدام التطبيق أو تحتاج إلى التواصل معنا

source: Theme mode
ar: السمة

# youCanChangeTheme
source: You can change the theme mode to the mode that you want light mode which is default, Or dark mode, And change it as many times as you want
ar: يمكنك تغيير وضع السمة إلى الوضع الذي تريده وهو الوضع الفاتح وهو الوضع الافتراضي، أو الوضع المظلم، وتغييره عدة مرات كما تريد

# youCanChangeLanguage
source: You can change the language to the language that you want english which is default, Or arabic , And change it as many times as you want
ar: يمكنك تغيير اللغة إلى اللغة التي تريدها اما الإنجليزية و هي اللغه الافتراضية أو العربية، وتغييرها عدة مرات كما تريد

# lightMode
source: Light
ar: نهاري

# darkMode
source: Dark
ar: ليلي

source: Settings
ar: الإعدادات

source: Language
ar: اللغه

source: English
ar: انجليزية

source: Arabic
ar: عربية

# egyptianSign
source: Egyptian Sign Language App
ar: تطبيق لغة الإشارة المصرية

source: We Hear you
ar: نحن نسمعك

# fakeSign
source: Fake sign language is spreading on TikTok
ar: لغة الإشارة المزيفة تنتشر على TikTok

# readArticle
source: Read The Article
ar: اقرأ المقالة

# signLanguageOverView
source: Sign Language - an overview
ar: لغة الإشارة – نظرة عامة

# definitionSign
source: Sign language | Definition, History, & Facts
ar: لغة الإشارة | التعريف والتاريخ والحقائق

# exploring
source: Exploring Sign Language and its Benefits
ar: استكشاف لغة الإشارة وفوائدها

# theFutureOfSign
source: What Does the Future Hold for Sign Language Interpreting?
ar: ماذا يحمل المستقبل لترجمة لغة الإشارة؟

# moreFunctionSigns
source: 10 MORE Functional Signs for Autism + Non Verbal + Sign Language Basics + Baby Sign + Communication
ar: 10 علامات وظيفية أخرى للتوحد + غير لفظية + أساسيات لغة الإشارة + إشارة الطفل + التواصل

# egyptOrASL
source: EGYPT | ASL - American Sign Language
ar: مصر | ASL - لغة الإشارة الأمريكية
